<?php


/*

 我接触我这个php 是自学加工作中遇到问题解决问题慢慢成长的。每次解决问题的时候，经常百度，用到一些我不是很熟悉的方法或者代码。缺少总结，问题解决了，但是我还是没有成长。慢慢感觉就到瓶颈了。越来越有感悟：学习一个新东西最好系统完整的学习。看到一个新的指令或者程序内置方法。得想想在什么环境下要用到这个指令的。然后就是多敲代码多测试。看懂了一般都不一定是自己的。尤其对我来说特别对，看懂了 下次让自己做，还是做不出来，还是找以前的copy过来。
  
 看了廖老师的git讲解。让我对git是什么，git在什么情况下用到。git有什么优点有了一个概念性的理解。配合老师幽默的讲解。假设的场景，我自己再多测试。让我了解到每个指令的使用场景，掌握了git的基本使用。我自己也把常用的指令做了笔记，放在自己博客上，以备以后忘记了快速查询。谢谢老师 ！！！ 
 
 以前自己用过svn都是遇到一个百度一个。会基本用了，但是没总结，对svn没整体概念。突然发现一段时间没用。svn都快忘记了。记的好模糊。git不会重蹈覆辙了，我整体有这么个概念了，再记了常用命令。工作实践一段时间。以后忘记了，最多也就是查查具体指令，而不需要像svn这种 我觉得我得重新去看下整体知识了。节省了不少时间。感谢老师！！！
 




*/